In [17]:
#PANDAS
#data frame is list of list
#series is list 
import pandas as pd
import numpy as np

In [18]:
fruits=["apple","mango","orange","watermelon"];
q1=[20,10,45,32]
q2=[17,13,31,32]
x=pd.Series(q1,index=fruits)
x1=pd.Series(q2,index=fruits)
print(x+x1)

apple         37
mango         23
orange        76
watermelon    64
dtype: int64

In [19]:
fruits2=["peaches","mango","orange","lemon"];
s1=pd.Series(q1,index=fruits)
s2=pd.Series(q2,index=fruits2)
print(s1+s2)

apple          NaN
lemon          NaN
mango         23.0
orange        76.0
peaches        NaN
watermelon     NaN
dtype: float64

In [20]:
print(s1['apple'])
print(s1[["mango","apple","orange"]])

20
mango     10
apple     20
orange    45
dtype: int64

In [21]:
print((s1+3)*2)
print((np.sin(s2)))

apple         46
mango         26
orange        96
watermelon    70
dtype: int64
peaches   -0.961397
mango      0.420167
orange    -0.404038
lemon      0.551427
dtype: float64

In [22]:
print(s1)

apple         20
mango         10
orange        45
watermelon    32
dtype: int64

In [26]:
s1.apply(np.log)

apple         2.995732
mango         2.302585
orange        3.806662
watermelon    3.465736
dtype: float64

In [27]:
np.log(s1)

apple         2.995732
mango         2.302585
orange        3.806662
watermelon    3.465736
dtype: float64

In [25]:
s1.apply(lambda x:x if x > 50 else x+10)

apple         30
mango         20
orange        55
watermelon    42
dtype: int64

Creating series from dictionary

In [28]:
cities = {
    "london": 1234,
    "Berlin": 4567,
    "Madrid": 5678,
    "Rome": 2545,
    "Paris": 6597,
    "Vienna": 4398,
    "Munich": 9857,
    "Milan": 3242
}

y = pd.Series(cities)
print(y)

london    1234
Berlin    4567
Madrid    5678
Rome      2545
Paris     6597
Vienna    4398
Munich    9857
Milan     3242
dtype: int64

In [31]:
my_cities=["london","paris","delhi","zurich","berlin"]
my_cities_series=pd.Series(cities,index=my_cities)
my_cities_series

london    1234.0
paris        NaN
delhi        NaN
zurich       NaN
berlin       NaN
dtype: float64

In [32]:
my_cities_series.isnull()

london    False
paris      True
delhi      True
zurich     True
berlin     True
dtype: bool

In [33]:
my_cities_series.notnull()

london     True
paris     False
delhi     False
zurich    False
berlin    False
dtype: bool

In [34]:
#differnce between NaN and not None
d={'a':4,'b':None ,'c':5,'d':20}
s=pd.Series(d)
print(s)
pd.isnull(s)

a     4.0
b     NaN
c     5.0
d    20.0
dtype: float64

a    False
b     True
c    False
d    False
dtype: bool

In [36]:
print(my_cities_series.fillna(0))

london    1234.0
paris        0.0
delhi        0.0
zurich       0.0
berlin       0.0
dtype: float64

In [40]:
missing={"Delhi":2456,"Zurich":5678}
my_cities_series.fillna(missing)

london    1234.0
paris        NaN
delhi        NaN
zurich       NaN
berlin       NaN
dtype: float64

DataFrames

In [42]:
years=range(2014,2018)
s1=pd.Series([123,456,789,432])
s2=pd.Series([234,768,234,565])
s3=pd.Series([434,878,678,123])
df=pd.concat([s1,s2,s3],axis=1)
df

     0    1    2
0  123  234  434
1  456  768  878
2  789  234  678
3  432  565  123

In [43]:
years=range(2014,2018)
s1=pd.Series([123,456,789,432],index=years)
s2=pd.Series([234,768,234,565],index=years)
s3=pd.Series([434,878,678,123],index=years)
df=pd.concat([s1,s2,s3],axis=1)
df

        0    1    2
2014  123  234  434
2015  456  768  878
2016  789  234  678
2017  432  565  123

In [46]:
cities=['a','b','c']
df.columns=cities
df

        a    b    c
2014  123  234  434
2015  456  768  878
2016  789  234  678
2017  432  565  123

In [47]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [67]:
cities = {"City":  ["London", "Berlin", "Madrid", "Rome",
                    "Paris", "Vienna", "Bucharest", "Hamburg",
                    "Budapest", "Warsaw", "Barcelona",
                    "Munich", "Milan"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305, 1805681, 1803425, 1760433,
                         1754000, 1740119, 1602386, 1493900,
                         1350680],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France", "Austria", "Romania",
                      "Germany", "Hungary", "Poland", "Spain",
                      "Germany", "Italy"] }

In [68]:
df=pd.DataFrame(cities)
df

         City  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

In [69]:
pd.DataFrame.from_dict(cities)

         City  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

In [70]:
pd.DataFrame.from_dict(cities,orient='index')

,0,1,2,3,4,5,6,7,8,9,10,11,12
City,London,Berlin,Madrid,Rome,Paris,Vienna,Bucharest,Hamburg,Budapest,Warsaw,Barcelona,Munich,Milan
population,8615246,3562166,3165235,2874038,2273305,1805681,1803425,1760433,1754000,1740119,1602386,1493900,1350680
country,England,Germany,Spain,Italy,France,Austria,Romania,Germany,Hungary,Poland,Spain,Germany,Italy

In [71]:
df.columns

Index(['City', 'population', 'country'], dtype='object')

In [72]:
df.reindex(columns=['country','City','population'])

    country       City  population
0   England     London     8615246
1   Germany     Berlin     3562166
2     Spain     Madrid     3165235
3     Italy       Rome     2874038
4    France      Paris     2273305
5   Austria     Vienna     1805681
6   Romania  Bucharest     1803425
7   Germany    Hamburg     1760433
8   Hungary   Budapest     1754000
9    Poland     Warsaw     1740119
10    Spain  Barcelona     1602386
11  Germany     Munich     1493900
12    Italy      Milan     1350680

In [73]:
df=df.set_index("country")
df

              City  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [76]:
df.loc[["Germany","France"]]

            City  population
country
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900
France     Paris     2273305

In [78]:
print(type(df.population))

<class 'pandas.core.series.Series'>

In [77]:
condition=df.population > 2000000
condition

country
England     True
Germany     True
Spain       True
Italy       True
France      True
Austria    False
Romania    False
Germany    False
Hungary    False
Poland     False
Spain      False
Germany    False
Italy      False
Name: population, dtype: bool

In [79]:
df.loc[condition]

           City  population
country
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

In [82]:
df.loc[ ~ condition]

              City  population
country
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [83]:
condition2=df['City'].str.contains('r')
df.loc[condition & condition2]

           City  population
country
Germany  Berlin     3562166
Spain    Madrid     3165235
France    Paris     2273305

In [84]:
milan=['milan',123456]
df.iloc[-1]=milan
df

              City  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        milan      123456

In [85]:
df.iloc[[0,3,6]]

#loc use for access by label 
#iloc use for access by indexdf

              City  population
country
England     London     8615246
Italy         Rome     2874038
Romania  Bucharest     1803425

In [86]:
df.head(5)

           City  population
country
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

In [91]:
df=pd.DataFrame(columns=['name','x','y'])
for i in range(10):
    df.loc[i]=['name'+ str(i)]+list(np.random.randint(10,size=2))
df

    name  x  y
0  name0  2  2
1  name1  3  0
2  name2  9  2
3  name3  8  9
4  name4  9  2
5  name5  8  5
6  name6  6  4
7  name7  5  1
8  name8  1  1
9  name9  2  0

In [92]:
df.T

          0      1      2      3      4      5      6      7      8      9
name  name0  name1  name2  name3  name4  name5  name6  name7  name8  name9
x         2      3      9      8      9      8      6      5      1      2
y         2      0      2      9      2      5      4      1      1      0

In [95]:
df.replace(to_replace={'name':{"name0":"vasu","name1":"sarthak"}})

      name  x  y
0     vasu  2  2
1  sarthak  3  0
2    name2  9  2
3    name3  8  9
4    name4  9  2
5    name5  8  5
6    name6  6  4
7    name7  5  1
8    name8  1  1
9    name9  2  0

In [99]:
value=np.random.randint(1,20,(30,))
fruits=["apple","mangoes","oranges","watermelon"]
fruits_index=np.random.choice(fruits,(30,))
s=pd.Series(value,fruits_index)
s[:10]

mangoes     1
oranges    10
apple      19
apple      10
mangoes     4
apple      14
oranges    18
apple      12
mangoes     6
mangoes    15
dtype: int32

In [100]:
grouped=s.groupby(s.index)
for fruit,obj in grouped:
    print(f"===={fruit}====")
    print(obj)

====apple====
apple    19
apple    10
apple    14
apple    12
apple    18
apple     9
apple    16
dtype: int32
====mangoes====
mangoes     1
mangoes     4
mangoes     6
mangoes    15
mangoes     4
mangoes     1
mangoes    14
dtype: int32
====oranges====
oranges    10
oranges    18
oranges    15
oranges    16
oranges    10
oranges    10
oranges     7
oranges     9
oranges     6
dtype: int32
====watermelon====
watermelon     2
watermelon     6
watermelon    10
watermelon     1
watermelon     3
watermelon    11
watermelon    15
dtype: int32